Функция СведенияОВнешнейОбработке() Экспорт
    
    //Инициализируем структуру с параметрами регистрации    	
	ПараметрыРегистрации = Новый Структура;
    
    // Первый параметр, который мы должны указать - это какой вид обработки системе должна зарегистрировать.
	// Допустимые типы: ДополнительнаяОбработка, ДополнительныйОтчет, ЗаполнениеОбъекта, Отчет, ПечатнаяФорма, СозданиеСвязанныхОбъектов
    ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов...
	ПараметрыРегистрации.Вставить("Наименование", "1с_ObmSchem построитель схем обменов"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	
	// Отключение безопасного режима необходимо для:
	// 1. Записи во временный файл при архивировании данных для отправки по api на plantuml.com.  
	// 2. Использования HTTP cоединения, чтобы отправить данные по api на plantuml.com для формирования схемы PlantUML.
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);  // Зададим право обработке на использование безопасного режима. Более подробно можно узнать в справке к платформе (метод УстановитьБезопасныйРежим)
		
	ПараметрыРегистрации.Вставить("Версия", "1.0");   // эти два параметра играют больше информационную роль,
	ПараметрыРегистрации.Вставить("Информация", "Обработка"); // т.е. это то, что будет видеть пользователь в информации к обработке
	
	// КОМАНДЫ
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Представление",Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	// Добавление команды
	НовСтрока = ТаблицаКоманд.Добавить();
	НовСтрока.Идентификатор = "1с_ObmSchem построитель схем обменов";
	НовСтрока.Использование = "ОткрытиеФормы";
	НовСтрока.Представление = "1с_ObmSchem построитель схем обменов";
	НовСтрока.ПоказыватьОповещение = Истина;
	НовСтрока.Модификатор = "";
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации; 
    
КонецФункции